CREATE DATABASE  IF NOT EXISTS `stumanagementbyweb` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `stumanagementbyweb`;
-- MySQL dump 10.13  Distrib 8.0.11, for Win64 (x86_64)
--
-- Host: localhost    Database: stumanagementbyweb
-- ------------------------------------------------------
-- Server version	8.0.11

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
 SET NAMES utf8 ;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `login`
--

DROP TABLE IF EXISTS `login`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `login` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `user` varchar(45) NOT NULL,
  `password` varchar(45) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `login`
--

LOCK TABLES `login` WRITE;
/*!40000 ALTER TABLE `login` DISABLE KEYS */;
INSERT INTO `login` VALUES (1,'admin','admin'),(2,'Test','Test'),(3,'10086','10086'),(4,'张正贤','admin');
/*!40000 ALTER TABLE `login` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `studentinfo`
--

DROP TABLE IF EXISTS `studentinfo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `studentinfo` (
  `id` char(15) NOT NULL,
  `name` varchar(45) NOT NULL,
  `sex` varchar(45) NOT NULL,
  `birthday` varchar(45) NOT NULL,
  `schoolday` varchar(45) NOT NULL,
  `major` varchar(45) NOT NULL,
  `college` varchar(45) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `studentinfo`
--

LOCK TABLES `studentinfo` WRITE;
/*!40000 ALTER TABLE `studentinfo` DISABLE KEYS */;
INSERT INTO `studentinfo` VALUES ('123271631102102','孙悟空','女','1991-02-21','2015-09-01','旅游管理','财经管理学院'),('123271631102103','猪八戒','男','1991-12-31','2016-09-01','国际贸易实务','工商管理学院'),('123271631102104','沙僧','男','1993-02-01','2016-09-01','电子信息工程技术','电子信息学院'),('123271631102105','白龙马','男','1999-03-31','2017-09-01','汽车检测与维修技术','机电工程学院'),('123271631102108','Choker','男','2018-06-20','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102120','张三','女','2018-06-11','2018-06-21','电子信息工程技术','电子信息学院'),('123271631102122','谢广坤','男','2018-06-18','2018-06-22','汽车检测与维修技术','机电工程学院'),('123271631102124','李四','男','2018-06-20','2018-06-23','市场营销','工商管理学院'),('123271631102125','王五','男','2018-06-11','2018-06-14','市场营销','工商管理学院'),('123271631102126','杜甫','男','2018-06-10','2018-06-22','光伏发电技术与应用','电子信息学院'),('123271631102130','张三','男','2018-06-20','2018-06-14','市场营销','工商管理学院'),('123271631102131','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102132','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102133','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102134','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102135','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102136','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102137','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102138','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102139','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102140','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102141','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102142','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102143','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102144','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102145','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102146','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102147','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102148','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102149','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102150','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102151','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102152','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102153','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102154','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102155','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102156','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102157','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102158','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102159','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102160','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102161','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102162','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102163','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102164','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102165','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102166','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102167','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102168','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102169','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102170','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102171','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102172','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102173','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102174','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102175','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102176','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102177','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102178','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102179','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102180','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102181','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102182','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102183','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102184','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102185','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102186','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102187','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102188','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院'),('123271631102189','李四','女','1999-03-31','2018-06-22','电子信息工程技术','电子信息学院');
/*!40000 ALTER TABLE `studentinfo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping events for database 'stumanagementbyweb'
--

--
-- Dumping routines for database 'stumanagementbyweb'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2018-07-18 15:54:19
